driver-tests/bpelse/nmproperty/SOAPHeader/src/copyHeaderToHeader.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="copyHeaderToHeader" targetNamespace="http://j2ee.netbeans.org/wsdl/SOAPHeader/copyHeaderToHeader"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/SOAPHeader/copyHeaderToHeader" xmlns:ns="http://localhost/person" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/SOAPHeader/copyHeaderToHeader">
            <xsd:import namespace="http://localhost/person" schemaLocation="person.xsd"/>
        </xsd:schema>
    </types>
    <message name="copyHeaderToHeaderOperationRequest">
        <part name="part1" element="ns:person"/>
    </message>
    <message name="copyHeaderToHeaderOperationResponse">
        <part name="part1" element="ns:person"/>
    </message>
    <portType name="copyHeaderToHeaderPortType">
        <operation name="copyHeaderToHeaderOperation">
            <input name="input1" message="tns:copyHeaderToHeaderOperationRequest"/>
            <output name="output1" message="tns:copyHeaderToHeaderOperationResponse"/>
        </operation>
    </portType>
    <binding name="copyHeaderToHeaderBinding" type="tns:copyHeaderToHeaderPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="copyHeaderToHeaderOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="copyHeaderToHeaderService">
        <port name="copyHeaderToHeaderPort" binding="tns:copyHeaderToHeaderBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/copyHeaderToHeaderService/copyHeaderToHeaderPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="copyHeaderToHeader">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="copyHeaderToHeaderPortTypeRole" portType="tns:copyHeaderToHeaderPortType"/>
    </plnk:partnerLinkType>
</definitions>
